arlisgreat/PresenceCardVenture/firmware/sdkconfig.defaults
# ============================================================
# M5Stack CoreS3 美颜相机 sdkconfig 默认项
# ============================================================
CONFIG_IDF_TARGET="esp32s3"

# --- 性能: 双核 240MHz，开 PSRAM ---
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# S3 I/D-Cache 扩容至 32KB: 像素算子 / 滤波 LUT / 缩放行缓冲命中率提升,
# 对逐像素渲染收益明显 (代价: 片内 SRAM 各减 16KB, CoreS3 仍有 512KB 足够)
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_32KB=y

# --- 中文字体 (P0: 默认 Montserrat 无 CJK 字形, 中文会渲染为方块) ---
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_16_CJK=y
CONFIG_LV_FONT_DEFAULT_SOURCE_HAN_SANS_SC_16_CJK=y
CONFIG_LV_FONT_MONTSERRAT_14=y

# --- LVGL 全尺寸缓冲(320x240x2B)放 PSRAM ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEM_CUSTOM_INCLUDE="stdlib.h"
CONFIG_LV_MEM_CUSTOM_ALLOC=malloc
CONFIG_LV_USE_CANVAS=y
CONFIG_LV_USE_QRCODE=y

# --- 摄像头与文件系统 ---
CONFIG_FATFS_LFN_HEAP=y
# CoreS3 板载 16MB flash (PlatformIO 默认探测可能误判为 2MB)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- 任务栈 (栈溢出 review) ---
# esp_event 系统任务默认 2304B 过小 (wifi/prov 事件回调在其栈上, ESP_LOG 即近极限)
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
# main 任务默认 3584B: app_main 里创建整套 LVGL UI, 加大到 6144
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
# 栈溢出金丝雀检测 (IDF 默认已开, 显式声明防误关)
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# --- BLE 配网 (wifi_provisioning + NimBLE, 比 Bluedroid 省 ~100KB) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# --- 联网 (Presence Card docs/02 §6) ---
# HTTPS 证书校验走 IDF 内置 bundle (含 ISRG Root X1); 禁止 skip_cert_verify
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
# TLS 握手 ~40KB 堆, mbedTLS 缓冲放 PSRAM 之外的默认堆即可 (CoreS3 SRAM 足够)

# --- 堆完整性 (联调/仿真期开启, 每块前后毒化字节, malloc/free 校验; 发布可关) ---
CONFIG_HEAP_POISONING_COMPREHENSIVE=y

# --- 日志 ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- OTA (docs/02 §3.1 fw_latest) ---
# 回滚保护: 新固件首次启动为 PENDING_VERIFY, 自检 (首次 feed 同步成功) 后
# pvc_ota_mark_valid() 落账; 未落账即重启/崩溃则 bootloader 自动回滚旧槽
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
